Documents/ESB/ESB_Consumer_0728/003TestSample/SAMPLE_XML_MUST/Payment/PA04_UnlockAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/Payment/UnlockAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>Payment</ServiceDomain>  
      <OperationName>UnlockAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:UnlockAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>PA04</v11:TxnId>  
        <v11:TxnNo>PA0400001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CardNo>4563020616112800</v11:CardNo>  
        <v11:TxnDate>20160501</v11:TxnDate>  
        <v11:TxnTime>123456</v11:TxnTime>  
        <v11:AuthKey>016290</v11:AuthKey>  
        <v11:TxnAmt>1000</v11:TxnAmt>  
        <v11:LockSeqNo>ACLK1615297806</v11:LockSeqNo>  
        <v11:UpdtUserId>joe</v11:UpdtUserId>  
        <v11:SprvsrlId>joe</v11:SprvsrlId> 
      </v11:ServiceBody> 
    </v11:UnlockAddRq> 
  </soap:Body> 
</soap:Envelope>
